examples/tumor_chip_linear_gradient/data/diagnostic/ladder_scan/case_009/system/blockMeshDict
        FoamFile
        {
            version     2.0;
            format      ascii;
            class       dictionary;
            object      blockMeshDict;
        }

        convertToMeters 0.001;

        vertices
        (
    (0.000000 0.000000 0.000000)
    (10.000000 0.000000 0.000000)
    (0.000000 0.506608 0.000000)
    (10.000000 0.506608 0.000000)
    (0.000000 1.013216 0.000000)
    (10.000000 1.013216 0.000000)
    (0.000000 1.519824 0.000000)
    (10.000000 1.519824 0.000000)
    (0.000000 2.026431 0.000000)
    (10.000000 2.026431 0.000000)
    (0.000000 2.533039 0.000000)
    (10.000000 2.533039 0.000000)
    (0.000000 3.039647 0.000000)
    (10.000000 3.039647 0.000000)
    (0.000000 3.546255 0.000000)
    (10.000000 3.546255 0.000000)
    (0.000000 4.052863 0.000000)
    (10.000000 4.052863 0.000000)
    (0.000000 0.000000 0.200000)
    (10.000000 0.000000 0.200000)
    (0.000000 0.506608 0.200000)
    (10.000000 0.506608 0.200000)
    (0.000000 1.013216 0.200000)
    (10.000000 1.013216 0.200000)
    (0.000000 1.519824 0.200000)
    (10.000000 1.519824 0.200000)
    (0.000000 2.026431 0.200000)
    (10.000000 2.026431 0.200000)
    (0.000000 2.533039 0.200000)
    (10.000000 2.533039 0.200000)
    (0.000000 3.039647 0.200000)
    (10.000000 3.039647 0.200000)
    (0.000000 3.546255 0.200000)
    (10.000000 3.546255 0.200000)
    (0.000000 4.052863 0.200000)
    (10.000000 4.052863 0.200000)
        );

        blocks
        (
    hex (0 1 3 2 18 19 21 20) (200 13 1) simpleGrading (1 1 1)
    hex (2 3 5 4 20 21 23 22) (200 13 1) simpleGrading (1 1 1)
    hex (4 5 7 6 22 23 25 24) (200 13 1) simpleGrading (1 1 1)
    hex (6 7 9 8 24 25 27 26) (200 13 1) simpleGrading (1 1 1)
    hex (8 9 11 10 26 27 29 28) (200 13 1) simpleGrading (1 1 1)
    hex (10 11 13 12 28 29 31 30) (200 13 1) simpleGrading (1 1 1)
    hex (12 13 15 14 30 31 33 32) (200 13 1) simpleGrading (1 1 1)
    hex (14 15 17 16 32 33 35 34) (200 13 1) simpleGrading (1 1 1)
        );

        edges ();

        boundary
        (
inlet_0
{
    type patch;
    faces
    (
                (0 18 20 2)
    );
}
inlet_1
{
    type patch;
    faces
    (
                (2 20 22 4)
    );
}
inlet_2
{
    type patch;
    faces
    (
                (4 22 24 6)
    );
}
inlet_3
{
    type patch;
    faces
    (
                (6 24 26 8)
    );
}
inlet_4
{
    type patch;
    faces
    (
                (8 26 28 10)
    );
}
inlet_5
{
    type patch;
    faces
    (
                (10 28 30 12)
    );
}
inlet_6
{
    type patch;
    faces
    (
                (12 30 32 14)
    );
}
inlet_7
{
    type patch;
    faces
    (
                (14 32 34 16)
    );
}
outlet
{
    type patch;
    faces
    (
                (1 3 21 19)
(3 5 23 21)
(5 7 25 23)
(7 9 27 25)
(9 11 29 27)
(11 13 31 29)
(13 15 33 31)
(15 17 35 33)
    );
}
walls
{
    type wall;
    faces
    (

    );
}
floor
{
    type wall;
    faces
    (
                (0 1 19 18)
(16 34 35 17)
    );
}
frontAndBack
{
    type empty;
    faces
    (
                (0 2 3 1)
(2 4 5 3)
(4 6 7 5)
(6 8 9 7)
(8 10 11 9)
(10 12 13 11)
(12 14 15 13)
(14 16 17 15)
(18 19 21 20)
(20 21 23 22)
(22 23 25 24)
(24 25 27 26)
(26 27 29 28)
(28 29 31 30)
(30 31 33 32)
(32 33 35 34)
    );
}
        );

        mergePatchPairs ();
